app/Http/Controllers/Admin/OrderLogController.php

    public function downloadPdf($trx_id)
    {
        // 1. Fetch Order with Security Check
        $admin = auth()->guard('admin')->user();
        $query = ProductOrder::with(['user', 'payment_gateway']);

        if ($admin->username !== 'superadmin') {
            $query->whereHas('user', function ($q) use ($admin) {
                $q->where('assign_to', $admin->username);
            });
        }

        $transaction = $query->where('trx_id', $trx_id)->firstOrFail();
---
select * from `product_orders` where `trx_id` = 'PB00169532' limit 1
select * from `users` where `users`.`id` in (1)